In [33]:
import pandas as pd

De todo esto, nos damos cuenta que solo tenemos que limpiar algunas de las columnas, en concreto age, species, country, fatal, year, sex. Si reducimos esto a una tabla para saber que tenemos ya limpito y que no:

Entre las tareas que tendr√©is que hacer hoy:
- Al empezar a trabajar con este dataframe ya eliminamos algunas columnas que a priori no nos interesaban. Ahora llega el momento de eliminar alguna columna m√°s. En este caso vamos tendr√©is que eliminar las columnas que no nos sean √∫tiles para contestar a nuestras preguntas. Pero ojo ‚ö†Ô∏è, haced una copia del dataframe para no "cargarnos" el dataframe original y perder la info.
- ¬øHay valores duplicados en nuestro dataframe? En caso de que los haya, elimin√°ndolos.
- Como hemos visto, algunas columnas no tienen el tipo de datos que deber√≠an. Cambiad el tipo de dato para la columna de year.
- En la columna de country poner todos los valores en min√∫sculas.
- üí° Pista Tendr√©is que usar una funci√≥n o una lambda üí°
- Guardamos el csv para seguir trabajando en el siguiente ejercicio de pair de limpieza.

In [34]:
#Cargamos nuestro DataFrame
df_original=pd.read_csv('../EDA/datos/attack_limpio.csv',index_col=0)

In [35]:
df_original.head()

,case_number,year,type,country,area,location,activity,name,age,time,species_,href,injury,date,mes,fatal_,sex2
0,1800.00.00,1800.0,Unprovoked,SEYCHELLES,St. Anne,NaN,a corsair's boat was overturned,NaN,NaN,NaN,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...,"FATAL, all onboard were killed by sharks",1800,NaN,y,F
1,1797.05.28.R,1797.0,Unprovoked,NaN,NaN,NaN,Dropped overboard,child,NaN,NaN,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...,FATAL,Reported May-28-1797,May,y,NaN
2,1792.09.12,1792.0,Provoked,ENGLAND,NaN,On the Thames River,Fishing,male,NaN,NaN,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...,"FATAL, PROVOKED INCIDENT",12-Sep-1792,Sep,y,M
3,1791.00.00,1791.0,Unprovoked,AUSTRALIA,New South Wales,Port Jackson,NaN,"female, an Australian aboriginal",NaN,NaN,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...,"FATAL, ""bitten in two""",1791,NaN,y,F
4,1788.05.10,1788.0,Boat,AUSTRALIA,New South Wales,Sydney Harbor,Fishing,boat,NaN,NaN,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...,"No injury to occupants, shark bit oar and rudder",10-May-1788,May,n,NaN

EJERCICIO 1: Al empezar a trabajar con este dataframe ya eliminamos algunas columnas que a priori no nos interesaban. Ahora llega el momento de eliminar alguna columna m√°s. En este caso vamos tendr√©is que eliminar las columnas que no nos sean √∫tiles para contestar a nuestras preguntas. Pero ojo ‚ö†Ô∏è, haced una copia del dataframe para no "cargarnos" el dataframe original y perder la info.

In [36]:
df=df_original.copy()

In [37]:
df.head(2)

,case_number,year,type,country,area,location,activity,name,age,time,species_,href,injury,date,mes,fatal_,sex2
0,1800.00.00,1800.0,Unprovoked,SEYCHELLES,St. Anne,NaN,a corsair's boat was overturned,NaN,NaN,NaN,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...,"FATAL, all onboard were killed by sharks",1800,NaN,y,F
1,1797.05.28.R,1797.0,Unprovoked,NaN,NaN,NaN,Dropped overboard,child,NaN,NaN,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...,FATAL,Reported May-28-1797,May,y,NaN

In [38]:
df.columns

Index(['case_number', 'year', 'type', 'country', 'area', 'location',
       'activity', 'name', 'age', 'time', 'species_', 'href', 'injury', 'date',
       'mes', 'fatal_', 'sex2'],
      dtype='object')

In [39]:
df.drop(["type","location","area","activity","name","href","injury","date"], axis=1, inplace=True)

In [40]:
df.head(2)

    case_number    year     country  age time species_  mes fatal_ sex2
0    1800.00.00  1800.0  SEYCHELLES  NaN  NaN      NaN  NaN      y    F
1  1797.05.28.R  1797.0         NaN  NaN  NaN      NaN  May      y  NaN

EJERCICIO 2: ¬øHay valores duplicados en nuestro dataframe? En caso de que los haya, elimin√°ndolos.

In [41]:
df.duplicated().sum()

0

EJERCICIO 3: Como hemos visto, algunas columnas no tienen el tipo de datos que deber√≠an. Cambiad el tipo de dato para la columna de year.

In [42]:
df.dtypes

case_number     object
year           float64
country         object
age             object
time            object
species_        object
mes             object
fatal_          object
sex2            object
dtype: object

In [43]:
df=df.astype({"year":"Int64"})

In [44]:
df=df.astype({"country":"object"})

In [45]:
df.dtypes

case_number    object
year            Int64
country        object
age            object
time           object
species_       object
mes            object
fatal_         object
sex2           object
dtype: object

In [46]:
df.head()

    case_number  year     country  age time species_  mes fatal_ sex2
0    1800.00.00  1800  SEYCHELLES  NaN  NaN      NaN  NaN      y    F
1  1797.05.28.R  1797         NaN  NaN  NaN      NaN  May      y  NaN
2    1792.09.12  1792     ENGLAND  NaN  NaN      NaN  Sep      y    M
3    1791.00.00  1791   AUSTRALIA  NaN  NaN      NaN  NaN      y    F
4    1788.05.10  1788   AUSTRALIA  NaN  NaN      NaN  May      n  NaN

In [47]:
df.dtypes

case_number    object
year            Int64
country        object
age            object
time           object
species_       object
mes            object
fatal_         object
sex2           object
dtype: object

EJERCICIO 4: En la columna de country poner todos los valores en min√∫sculas.

üí° Pista Tendr√©is que usar una funci√≥n o una lambda üí°

In [48]:
def minuscula(col):
    try: 
        col=col.lower()
        return col
    except:
        pass

In [49]:
df["country"]=df["country"].apply(minuscula)

In [50]:
df.head()

    case_number  year     country  age time species_  mes fatal_ sex2
0    1800.00.00  1800  seychelles  NaN  NaN      NaN  NaN      y    F
1  1797.05.28.R  1797        None  NaN  NaN      NaN  May      y  NaN
2    1792.09.12  1792     england  NaN  NaN      NaN  Sep      y    M
3    1791.00.00  1791   australia  NaN  NaN      NaN  NaN      y    F
4    1788.05.10  1788   australia  NaN  NaN      NaN  May      n  NaN

EJERCICIO 5: Guardamos el csv para seguir trabajando en el siguiente ejercicio de pair de limpieza.

In [53]:
df.to_csv('../EDA/datos/attack_limpio.csv')